ttft_ablation/results/throughput/sweep/A_c128_s1.log
Skipping import of cpp extensions due to incompatible torch version. Please upgrade to torch >= 2.11.0 (found 2.9.1+cu128).
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
benchmark_args=Namespace(backend='sglang', base_url='http://localhost:30001', host='0.0.0.0', port=None, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='', model='Qwen/Qwen3-0.6B', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/workspace/sglang/ttft_ablation/results/throughput/sweep/A_c128_s1.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)
Waiting up to 60s for http://localhost:30001/v1/models to become ready...
Server ready in 0.0s.
Namespace(backend='sglang', base_url='http://localhost:30001', host='0.0.0.0', port=30000, ready_check_timeout_sec=60, dataset_name='sharegpt', dataset_path='', model='Qwen/Qwen3-0.6B', served_model_name=None, tokenizer=None, num_prompts=1000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/workspace/sglang/ttft_ablation/results/throughput/sweep/A_c128_s1.json', output_details=False, print_requests=False, disable_tqdm=True, disable_stream=False, return_logprob=False, top_logprobs_num=0, token_ids_logprob=None, logprob_start_len=-1, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_start_step=None, profile_steps=None, profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=1.0, mooncake_num_rounds=1, mooncake_workload='conversation', fake_prefill=False, tag=None, header=None)

#Input tokens: 302118
#Output tokens: 195775
Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     1000      
Benchmark duration (s):                  33.13     
Total input tokens:                      302118    
Total input text tokens:                 302118    
Total generated tokens:                  195775    
Total generated tokens (retokenized):    195311    
Request throughput (req/s):              30.19     
Input token throughput (tok/s):          9120.26   
Output token throughput (tok/s):         5910.01   
Peak output token throughput (tok/s):    8146.00   
Peak concurrent requests:                173       
Total token throughput (tok/s):          15030.27  
Concurrency:                             107.77    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   3569.92   
Median E2E Latency (ms):                 2453.27   
P90 E2E Latency (ms):                    8596.17   
P99 E2E Latency (ms):                    14587.40  
---------------Time to First Token----------------
Mean TTFT (ms):                          114.81    
Median TTFT (ms):                        56.06     
P99 TTFT (ms):                           605.47    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.86     
Median TPOT (ms):                        18.61     
P99 TPOT (ms):                           47.74     
---------------Inter-Token Latency----------------
Mean ITL (ms):                           17.74     
Median ITL (ms):                         14.00     
P95 ITL (ms):                            36.59     
P99 ITL (ms):                            58.01     
Max ITL (ms):                            270.06    
==================================================